<script setup>
import anime from 'animejs'
import Modal from './Modal.vue'
import { ref, onMounted } from 'vue'


const haxck = ref(null)
const showModal = ref(false)
// onMounted(() => {
//   console.log(haxck.value.querySelector(".lines"))
//   anime({
//     targets: haxck.value.querySelectorAll(".lines>path"),
//     strokeDashoffset: [anime.setDashoffset, 1],
//     easing: 'easeInOutSine',
//     duration: 1800,
//     delay: function (el, i) { return i * 450 },
//     direction: 'alternate',
//     loop: false
//   });

// })
</script>

<template>
  <section class="ctx mx-1 mt-6 leading-10 text-lg tracking-wide dark:text-gray-300">
    <!-- <div ref="haxck" class="">
      <svg viewBox="0 0 280 100">
        <g fill="none" fill-rule="evenodd" stroke="#656565" stroke-width="2" class="lines">
          <path d="M 9 74 L 1 74 L 1 0 L 9 0 L 9 30.3 Q 11.8 26.2 16.1 23.5 A 17.572 17.572 0 0 1 23.225 20.991 A 22.595 22.595 0 0 1 26.2 20.8 A 23.225 23.225 0 0 1 31.265 21.318 Q 36.359 22.456 39.35 26.1 Q 43.475 31.126 43.688 39.209 A 33.764 33.764 0 0 1 43.7 40.1 L 43.7 74 L 34.7 74 L 34.7 41.1 Q 34.7 35.5 32.1 32.1 A 8.42 8.42 0 0 0 25.942 28.753 A 11.979 11.979 0 0 0 24.8 28.7 A 13.23 13.23 0 0 0 18.087 30.566 A 17.586 17.586 0 0 0 16.05 31.95 Q 11.9 35.2 9 39.6 L 9 75 Z" ></path>
          <path d="M 94.8 26.2 L 94.8 22 L 103 22 L 103 61.4 A 12.15 12.15 0 0 0 103.102 63.036 Q 103.434 65.47 104.85 66.35 Q 106.7 67.5 108.9 67.5 L 107 74.5 A 17.722 17.722 0 0 1 102.735 74.028 Q 97.098 72.628 95.503 67.08 A 13.59 13.59 0 0 1 95.4 66.7 A 21.307 21.307 0 0 1 92.29 70.126 A 28.498 28.498 0 0 1 89.15 72.55 Q 85.2 75.2 79.1 75.2 Q 72.6 75.2 67.3 71.9 A 22.947 22.947 0 0 1 59.887 64.373 A 27.923 27.923 0 0 1 58.85 62.55 A 27.228 27.228 0 0 1 56.22 54.608 A 36.644 36.644 0 0 1 55.7 48.3 A 33.142 33.142 0 0 1 56.697 40.031 A 27.968 27.968 0 0 1 58.85 34.3 Q 62 28.1 67.55 24.45 A 22.297 22.297 0 0 1 78.745 20.844 A 27.388 27.388 0 0 1 80.3 20.8 A 22.584 22.584 0 0 1 85.094 21.29 A 18.703 18.703 0 0 1 88.45 22.35 A 26.002 26.002 0 0 1 92.737 24.644 A 22.103 22.103 0 0 1 94.8 26.2 Z M 94 60.7 L 94 32.8 Q 91.3 30.9 88.05 29.75 Q 84.8 28.6 81.2 28.6 A 15.924 15.924 0 0 0 76.229 29.354 A 14.024 14.024 0 0 0 72.75 31.05 A 16.301 16.301 0 0 0 67.731 36.474 A 19.962 19.962 0 0 0 67 37.85 A 20.663 20.663 0 0 0 65.247 43.527 A 27.678 27.678 0 0 0 64.9 48 Q 64.9 53.6 67 57.95 A 17.602 17.602 0 0 0 70.106 62.496 A 15.697 15.697 0 0 0 72.8 64.75 Q 76.5 67.2 81.1 67.2 Q 84.9 67.2 88.3 65.35 Q 91.7 63.5 94 60.7 Z"></path>
          <path d="M 161.9 69.1 L 155.1 74.9 L 137.6 53.2 L 120.3 74.7 L 113.9 69.1 L 132.4 47.6 L 114.6 27 L 121.6 20.9 L 137.7 41.7 L 153.5 21.3 L 160.2 27 L 142.9 47.2 L 161.9 69.1 Z "></path>
          <path d="M 205.3 23.9 L 202.6 31.5 A 30.422 30.422 0 0 0 199.696 30.224 A 23.42 23.42 0 0 0 197.25 29.45 A 20.543 20.543 0 0 0 194.207 28.924 A 26.355 26.355 0 0 0 191.6 28.8 A 15.889 15.889 0 0 0 184.347 30.443 A 16.132 16.132 0 0 0 179.85 33.85 Q 175.1 38.9 175.1 47.8 A 25.192 25.192 0 0 0 175.805 53.86 A 21.45 21.45 0 0 0 177.1 57.6 A 18.564 18.564 0 0 0 180.01 62.177 A 16.275 16.275 0 0 0 182.65 64.6 Q 186.2 67.2 191 67.2 Q 194.165 67.2 196.568 66.61 A 15.08 15.08 0 0 0 197.5 66.35 Q 200.189 65.503 203.276 63.912 A 49.095 49.095 0 0 0 203.3 63.9 L 206.1 71.5 Q 203 73.2 199.15 74.2 Q 195.3 75.2 190.4 75.2 A 26.803 26.803 0 0 1 183.361 74.31 A 22.074 22.074 0 0 1 177.45 71.75 Q 171.9 68.3 168.9 62.15 Q 165.9 56 165.9 48 Q 165.9 40.5 168.95 34.3 Q 172 28.1 177.7 24.45 A 23.067 23.067 0 0 1 187.368 21.029 A 29.608 29.608 0 0 1 191.1 20.8 Q 195.5 20.8 198.85 21.6 Q 202.2 22.4 205.3 23.9 Z "></path>
          <path d="M 258.7 69 L 252.5 75 L 225.6 47.3 L 225.6 74 L 216.6 74 L 216.6 0 L 225.6 0 L 225.6 42.3 L 249.1 21 L 254.3 26.7 L 234.2 44.5 L 258.7 69 Z"></path>
        </g>
      </svg>
    </div> -->
    <!-- <h1 id="haxck" class="inline-block py-2 text-3xl uppercase font-semibold tracking-[1.6rem] dark:text-gray-300">Haxck
    </h1> -->
    <div class="relative flex rounded-full w-16 mt-8 mb-4 overflow-hidden">
      <img src="/images/unnamed.jpg" alt="">
    </div>

    <p>👋Hi, i'm haxck. </p>
    <p>如果失眠在深夜，<a class="c cursor-pointer" @click="showModal = true">NightMate</a>(微信小程序) 伴你入睡；如果心念某人，不如写一封 <a
        href="http://echo.haxck.com">Echo</a> 给 TA。</p>
    <p>更多内容欢迎来我 <a href="https://blog.haxck.com">Blog</a> 。</p>
  </section>
  <!-- <button id="show-modal" @click="showModal = true">Show Modal</button> -->

  <Teleport to="body">
    <!-- 使用这个 modal 组件，传入 prop -->
    <modal :show="showModal" @close="showModal = false">
      <template #body>
        <img src="/images/nightmate_qrcode.jpg" alt="">
      </template>
    </modal>
  </Teleport>
</template>